In [1]:
import numpy as np
import pandas as pd

In [2]:
 dict1 = {
     "Friends" : ['Om' , 'Prakhar' , 'Ayush' , 'Krish'],
     "Marks" : [98,97,96,94],
     "Cities" : ['New York' , 'Delhi' , 'Mumbai' , 'London']
 }

In [3]:
df = pd.DataFrame(dict1)

In [5]:
df

   Friends  Marks    Cities
0       Om     98  New York
1  Prakhar     97     Delhi
2    Ayush     96    Mumbai
3    Krish     94    London

In [6]:
df.to_csv('Friends.csv')

In [8]:
df.to_csv('Friends_index_Flase.csv' , index = False)

In [ ]:
 #df.head(2)
 #df.tail(2)

In [9]:
df.describe()

           Marks
count   4.000000
mean   96.250000
std     1.707825
min    94.000000
25%    95.500000
50%    96.500000
75%    97.250000
max    98.000000

In [10]:
#om = pd.read_csv('om.csv')
#om

In [11]:
#om['speed'][0] = 50 
#it will work but don't use it
#om.index = ['1st' , '2nd' , '3rd' , '4th']
ser = pd.Series(np.random.rand(34))
type(ser)

pandas.core.series.Series

In [12]:
ser

0     0.184274
1     0.571388
2     0.938142
3     0.482707
4     0.338116
5     0.490312
6     0.902312
7     0.735078
8     0.400853
9     0.537606
10    0.806204
11    0.215245
12    0.714202
13    0.896422
14    0.763504
15    0.391589
16    0.634040
17    0.155976
18    0.654287
19    0.659442
20    0.392764
21    0.436568
22    0.791293
23    0.217353
24    0.078239
25    0.699069
26    0.337106
27    0.865518
28    0.212847
29    0.811502
30    0.711570
31    0.314231
32    0.753876
33    0.611712
dtype: float64

In [16]:
newdf = pd.DataFrame(np.random.rand(334,5) , index = np.arange(334))
# newdf.head()
newdf

            0         1         2         3         4
0    0.698923  0.074558  0.841157  0.393742  0.424540
1    0.919862  0.536295  0.969886  0.085033  0.928890
2    0.817099  0.078785  0.994084  0.274691  0.751577
3    0.924968  0.347199  0.583712  0.542619  0.097663
4    0.253294  0.415470  0.110380  0.128507  0.792453
..        ...       ...       ...       ...       ...
329  0.610359  0.170453  0.919996  0.365908  0.352848
330  0.240930  0.356313  0.226225  0.213151  0.102933
331  0.390648  0.325037  0.006410  0.969635  0.172227
332  0.530161  0.636787  0.031745  0.062359  0.214878
333  0.012406  0.855916  0.575735  0.432139  0.750726

[334 rows x 5 columns]

In [17]:
type(newdf)

pandas.core.frame.DataFrame

In [20]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.498079    0.513295    0.498513    0.491198    0.493359
std      0.287637    0.293847    0.271789    0.291577    0.284603
min      0.012406    0.006826    0.003191    0.001020    0.000210
25%      0.252377    0.231711    0.268813    0.241434    0.234504
50%      0.495000    0.510243    0.501012    0.487100    0.490531
75%      0.752292    0.779190    0.708268    0.739595    0.746373
max      0.998280    0.997144    0.998345    0.998723    0.988720

In [21]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [ ]:
#newdf.index
#newdf.column
#newdf.to_numpy
#for transpose , we can use newdf.T
#newdf.sort_index(axis = 0 ; ascending = False)
#axis = 0 is row and axis = 1 is column
#newdf2 = newdf.copy() is copy and newdf2 = newdf is by refrence
#newdf.loc[2,2] = 234
#newdf.column = list("ABCDE")
#newdf.drop(0 , axis = 1)
# and operator might look like &
#newdf.iloc[0,4]
#newdf.drop(['A' , 'D'], axis = 1 , inplace = True)
#newdf.reset_index(drop = True , replace = True)